package Lesson_07.Ex002;

public class Point2D  {
    int x, y;
    
}

/*
 * Класс – это «чертеж» (описание) сущности
предметной области, позволяющий выделить
некоторые общие характеристики, состояние
и поведение, зависящее от состояния.

Предметная область — множество всех предметов
(явлений) решаемой проблемы.

Экземпляр класса – отдельный представитель
класса, имеющий КОНКРЕТНОЕ состояние
и поведение, которое полностью определяется
описанием класса.

Состояние – набор данных (полей, атрибутов,
членов класса).

Поведение – функции для работы с данными
и выполнения полезной работы.
 */